import numpy as np

zeros = np.zeros((3,4))
print(zeros)

# Здесь выводится матрица со всеми значениями = 0 (размерами 3 на 4)

"""[[0. 0. 0. 0.]
    [0. 0. 0. 0.]
    [0. 0. 0. 0.]]"""

ones = np.ones((2, 3))
print(ones)

# Здесь выводится матрица со всеми значениями = 1 (размерами 2 на 3)

"""[[1. 1. 1.]
    [1. 1. 1.]]"""

eye = np.eye(4)
print(eye)

#

"""[[1. 0. 0. 0.]
    [0. 1. 0. 0.]
    [0. 0. 1. 0.]
    [0. 0. 0. 1.]]"""

linspace = np.linspace(0, 10, 15)
print(linspace)

"""[ 0.          0.71428571  1.42857143  2.14285714  2.85714286  3.57142857
     4.28571429  5.          5.71428571  6.42857143  7.14285714  7.85714286
     8.57142857  9.28571429 10.        ]"""

arangee = np.arange(0, 10, 3)
print(arangee)

"""[0 3 6 9]"""